INFO  23:33:39,696 - Compiling source file: F:\GitHub\pp_proj\workspace\MJCompiler\test\simple.mj
INFO  23:33:39,726 - #40 program
INFO  23:33:39,726 - #45 MJProgram
INFO  23:33:39,726 - #45 int
INFO  23:33:39,726 - #45 x
INFO  23:33:39,727 - #13 ;
INFO  23:33:39,727 - #45 int
INFO  23:33:39,727 - #45 z
INFO  23:33:39,727 - #36 [
INFO  23:33:39,727 - #37 ]
INFO  23:33:39,727 - #13 ;
INFO  23:33:39,728 - #34 {
INFO  23:33:39,728 - #45 int
INFO  23:33:39,728 - #45 main
INFO  23:33:39,729 - #32 (
INFO  23:33:39,729 - #33 )
INFO  23:33:39,729 - #45 int
INFO  23:33:39,729 - #45 y
INFO  23:33:39,729 - #13 ;
INFO  23:33:39,729 - #34 {
INFO  23:33:39,729 - #41 print
INFO  23:33:39,729 - #32 (
INFO  23:33:39,729 - #9 1
INFO  23:33:39,730 - #12 ,
INFO  23:33:39,730 - #9 1
INFO  23:33:39,731 - #33 )
INFO  23:33:39,731 - #13 ;
INFO  23:33:39,731 - #41 print
INFO  23:33:39,731 - #32 (
INFO  23:33:39,731 - #10 a
INFO  23:33:39,731 - #12 ,
INFO  23:33:39,731 - #9 1
INFO  23:33:39,731 - #33 )
INFO  23:33:39,731 - #13 ;
INFO  23:33:39,731 - #45 z
INFO  23:33:39,731 - #28 =
INFO  23:33:39,732 - #31 new
INFO  23:33:39,732 - #45 int
INFO  23:33:39,732 - #36 [
INFO  23:33:39,732 - #9 5
INFO  23:33:39,732 - #37 ]
INFO  23:33:39,732 - #13 ;
INFO  23:33:39,732 - #45 z
INFO  23:33:39,732 - #36 [
INFO  23:33:39,732 - #9 0
INFO  23:33:39,732 - #37 ]
INFO  23:33:39,733 - #28 =
INFO  23:33:39,733 - #9 0
INFO  23:33:39,733 - #13 ;
INFO  23:33:39,733 - #41 print
INFO  23:33:39,733 - #32 (
INFO  23:33:39,733 - #45 z
INFO  23:33:39,733 - #36 [
INFO  23:33:39,733 - #9 0
INFO  23:33:39,733 - #37 ]
INFO  23:33:39,733 - #33 )
INFO  23:33:39,733 - #13 ;
INFO  23:33:39,733 - #45 y
INFO  23:33:39,733 - #28 =
INFO  23:33:39,733 - #9 5
INFO  23:33:39,733 - #13 ;
INFO  23:33:39,733 - #45 x
INFO  23:33:39,733 - #28 =
INFO  23:33:39,734 - #45 y
INFO  23:33:39,734 - #15 +
INFO  23:33:39,734 - #9 3
INFO  23:33:39,734 - #13 ;
INFO  23:33:39,735 - #41 print
INFO  23:33:39,735 - #32 (
INFO  23:33:39,735 - #45 x
INFO  23:33:39,735 - #33 )
INFO  23:33:39,735 - #13 ;
INFO  23:33:39,735 - #45 y
INFO  23:33:39,735 - #28 =
INFO  23:33:39,735 - #32 (
INFO  23:33:39,735 - #45 x
INFO  23:33:39,735 - #33 )
INFO  23:33:39,735 - #13 ;
INFO  23:33:39,735 - #45 x
INFO  23:33:39,735 - #29 ++
INFO  23:33:39,735 - #13 ;
INFO  23:33:39,735 - #41 print
INFO  23:33:39,736 - #32 (
INFO  23:33:39,736 - #45 x
INFO  23:33:39,736 - #33 )
INFO  23:33:39,736 - #13 ;
INFO  23:33:39,736 - #45 x
INFO  23:33:39,736 - #30 --
INFO  23:33:39,736 - #13 ;
INFO  23:33:39,736 - #41 print
INFO  23:33:39,736 - #32 (
INFO  23:33:39,736 - #32 (
INFO  23:33:39,736 - #32 (
INFO  23:33:39,736 - #45 x
INFO  23:33:39,736 - #33 )
INFO  23:33:39,736 - #33 )
INFO  23:33:39,736 - #33 )
INFO  23:33:39,736 - #13 ;
INFO  23:33:39,736 - #45 x
INFO  23:33:39,736 - #28 =
INFO  23:33:39,736 - #45 x
INFO  23:33:39,736 - #15 +
INFO  23:33:39,736 - #32 (
INFO  23:33:39,736 - #16 -
INFO  23:33:39,736 - #9 2
INFO  23:33:39,737 - #33 )
INFO  23:33:39,737 - #13 ;
INFO  23:33:39,737 - #41 print
INFO  23:33:39,737 - #32 (
INFO  23:33:39,737 - #45 x
INFO  23:33:39,737 - #33 )
INFO  23:33:39,737 - #13 ;
INFO  23:33:39,737 - #45 x
INFO  23:33:39,737 - #28 =
INFO  23:33:39,737 - #45 y
INFO  23:33:39,737 - #17 *
INFO  23:33:39,737 - #9 2
INFO  23:33:39,738 - #13 ;
INFO  23:33:39,738 - #41 print
INFO  23:33:39,738 - #32 (
INFO  23:33:39,738 - #45 x
INFO  23:33:39,738 - #33 )
INFO  23:33:39,738 - #13 ;
INFO  23:33:39,738 - #45 y
INFO  23:33:39,738 - #28 =
INFO  23:33:39,738 - #45 x
INFO  23:33:39,738 - #18 /
INFO  23:33:39,739 - #9 4
INFO  23:33:39,739 - #13 ;
INFO  23:33:39,739 - #41 print
INFO  23:33:39,739 - #32 (
INFO  23:33:39,739 - #45 y
INFO  23:33:39,739 - #33 )
INFO  23:33:39,739 - #13 ;
INFO  23:33:39,739 - #45 x
INFO  23:33:39,739 - #28 =
INFO  23:33:39,739 - #45 y
INFO  23:33:39,739 - #19 %
INFO  23:33:39,739 - #9 3
INFO  23:33:39,740 - #13 ;
INFO  23:33:39,740 - #41 print
INFO  23:33:39,740 - #32 (
INFO  23:33:39,740 - #45 x
INFO  23:33:39,740 - #33 )
INFO  23:33:39,740 - #13 ;
INFO  23:33:39,740 - #42 read
INFO  23:33:39,740 - #32 (
INFO  23:33:39,740 - #45 x
INFO  23:33:39,740 - #33 )
INFO  23:33:39,740 - #13 ;
INFO  23:33:39,740 - #45 x
INFO  23:33:39,740 - #28 =
INFO  23:33:39,740 - #45 x
INFO  23:33:39,740 - #17 *
INFO  23:33:39,740 - #45 y
INFO  23:33:39,740 - #13 ;
INFO  23:33:39,740 - #41 print
INFO  23:33:39,740 - #32 (
INFO  23:33:39,740 - #45 x
INFO  23:33:39,740 - #33 )
INFO  23:33:39,740 - #13 ;
INFO  23:33:39,740 - #41 print
INFO  23:33:39,741 - #32 (
INFO  23:33:39,741 - #11 false
INFO  23:33:39,741 - #12 ,
INFO  23:33:39,741 - #9 20
INFO  23:33:39,741 - #33 )
INFO  23:33:39,741 - #13 ;
INFO  23:33:39,741 - #8 return
INFO  23:33:39,741 - #9 0
INFO  23:33:39,741 - #13 ;
INFO  23:33:39,741 - #35 }
INFO  23:33:39,741 - #35 }
INFO  23:33:39,743 - ***Abstract tree****
INFO  23:33:39,743 - #0
DEBUG 23:33:39,751 - Variable with name x has the address of 0
DEBUG 23:33:39,751 - Variable with name y has the address of 0
DEBUG 23:33:39,751 - found constant with value 1of type 1
DEBUG 23:33:39,751 - constant factor is type 1
DEBUG 23:33:39,751 - term SingleFactorterm is type 1
DEBUG 23:33:39,751 - exprWithNoMinus is type 1
DEBUG 23:33:39,751 - found constant with value 1of type 1
DEBUG 23:33:39,751 - print statement has arg of type 1
DEBUG 23:33:39,752 - found constant with value *****of type 2
DEBUG 23:33:39,752 - found constant with value 97of type 2
DEBUG 23:33:39,752 - constant factor is type 2
DEBUG 23:33:39,752 - term SingleFactorterm is type 2
DEBUG 23:33:39,752 - exprWithNoMinus is type 2
DEBUG 23:33:39,752 - found constant with value 1of type 1
DEBUG 23:33:39,752 - print statement has arg of type 2
DEBUG 23:33:39,752 - found constant with value 5of type 1
DEBUG 23:33:39,752 - constant factor is type 1
DEBUG 23:33:39,752 - term SingleFactorterm is type 1
DEBUG 23:33:39,752 - exprWithNoMinus is type 1
DEBUG 23:33:39,752 - term SingleFactorterm is type 3
DEBUG 23:33:39,752 - exprWithNoMinus is type 3
ERROR 23:33:39,752 - Exprression is not assignable to desigantor
DEBUG 23:33:39,752 - found constant with value 0of type 1
DEBUG 23:33:39,752 - constant factor is type 1
DEBUG 23:33:39,752 - term SingleFactorterm is type 1
DEBUG 23:33:39,752 - exprWithNoMinus is type 1
DEBUG 23:33:39,752 - found constant with value 0of type 1
DEBUG 23:33:39,752 - constant factor is type 1
DEBUG 23:33:39,752 - term SingleFactorterm is type 1
DEBUG 23:33:39,752 - exprWithNoMinus is type 1
ERROR 23:33:39,752 - Exprression is not assignable to desigantor
DEBUG 23:33:39,752 - found constant with value 0of type 1
DEBUG 23:33:39,752 - constant factor is type 1
DEBUG 23:33:39,752 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - exprWithNoMinus is type 1
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - exprWithNoMinus is type 1
DEBUG 23:33:39,753 - print statement has arg of type 1
DEBUG 23:33:39,753 - found constant with value 5of type 1
DEBUG 23:33:39,753 - constant factor is type 1
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - exprWithNoMinus is type 1
ERROR 23:33:39,753 - Exprression is not assignable to desigantor
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - found constant with value 3of type 1
DEBUG 23:33:39,753 - constant factor is type 1
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - exprWithNoMinus is type 1
ERROR 23:33:39,753 - Exprression is not assignable to desigantor
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - exprWithNoMinus is type 1
DEBUG 23:33:39,753 - print statement has arg of type 1
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - exprWithNoMinus is type 1
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - exprWithNoMinus is type 1
ERROR 23:33:39,753 - Exprression is not assignable to desigantor
ERROR 23:33:39,753 - Increments are allowed only for int types, but found other type.
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - exprWithNoMinus is type 1
DEBUG 23:33:39,753 - print statement has arg of type 1
ERROR 23:33:39,753 - Decrements are allowed only for int types, but found other type.
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - exprWithNoMinus is type 1
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - exprWithNoMinus is type 1
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - exprWithNoMinus is type 1
DEBUG 23:33:39,753 - print statement has arg of type 1
DEBUG 23:33:39,753 - term SingleFactorterm is type 1
DEBUG 23:33:39,753 - found constant with value 2of type 1
DEBUG 23:33:39,753 - constant factor is type 1
DEBUG 23:33:39,754 - term SingleFactorterm is type 1
DEBUG 23:33:39,754 - ExprWithMinus is type 1
DEBUG 23:33:39,754 - term SingleFactorterm is type 1
DEBUG 23:33:39,754 - exprWithNoMinus is type 1
ERROR 23:33:39,754 - Exprression is not assignable to desigantor
DEBUG 23:33:39,754 - term SingleFactorterm is type 1
DEBUG 23:33:39,754 - exprWithNoMinus is type 1
DEBUG 23:33:39,754 - print statement has arg of type 1
DEBUG 23:33:39,754 - found constant with value 2of type 1
DEBUG 23:33:39,754 - constant factor is type 1
DEBUG 23:33:39,754 - term element is type 1
DEBUG 23:33:39,754 - term list single is type 1
DEBUG 23:33:39,754 - term MultiFactorTerm is type 1
DEBUG 23:33:39,754 - exprWithNoMinus is type 1
ERROR 23:33:39,754 - Exprression is not assignable to desigantor
DEBUG 23:33:39,754 - term SingleFactorterm is type 1
DEBUG 23:33:39,754 - exprWithNoMinus is type 1
DEBUG 23:33:39,754 - print statement has arg of type 1
DEBUG 23:33:39,754 - found constant with value 4of type 1
DEBUG 23:33:39,754 - constant factor is type 1
DEBUG 23:33:39,754 - term element is type 1
DEBUG 23:33:39,754 - term list single is type 1
DEBUG 23:33:39,754 - term MultiFactorTerm is type 1
DEBUG 23:33:39,754 - exprWithNoMinus is type 1
ERROR 23:33:39,754 - Exprression is not assignable to desigantor
DEBUG 23:33:39,754 - term SingleFactorterm is type 1
DEBUG 23:33:39,754 - exprWithNoMinus is type 1
DEBUG 23:33:39,754 - print statement has arg of type 1
DEBUG 23:33:39,754 - found constant with value 3of type 1
DEBUG 23:33:39,754 - constant factor is type 1
DEBUG 23:33:39,754 - term element is type 1
DEBUG 23:33:39,754 - term list single is type 1
DEBUG 23:33:39,754 - term MultiFactorTerm is type 1
DEBUG 23:33:39,754 - exprWithNoMinus is type 1
ERROR 23:33:39,754 - Exprression is not assignable to desigantor
DEBUG 23:33:39,754 - term SingleFactorterm is type 1
DEBUG 23:33:39,754 - exprWithNoMinus is type 1
DEBUG 23:33:39,754 - print statement has arg of type 1
ERROR 23:33:39,754 - The argument of the read statement must be of int or char type.
DEBUG 23:33:39,755 - term element is type 1
DEBUG 23:33:39,755 - term list single is type 1
DEBUG 23:33:39,755 - term MultiFactorTerm is type 1
DEBUG 23:33:39,755 - exprWithNoMinus is type 1
ERROR 23:33:39,755 - Exprression is not assignable to desigantor
DEBUG 23:33:39,755 - term SingleFactorterm is type 1
DEBUG 23:33:39,755 - exprWithNoMinus is type 1
DEBUG 23:33:39,755 - print statement has arg of type 1
DEBUG 23:33:39,755 - found constant with value 0of type 1
DEBUG 23:33:39,755 - constant factor is type 1
DEBUG 23:33:39,755 - term SingleFactorterm is type 1
DEBUG 23:33:39,755 - exprWithNoMinus is type 1
DEBUG 23:33:39,755 - found constant with value 20of type 1
DEBUG 23:33:39,755 - print statement has arg of type 1
DEBUG 23:33:39,755 - found constant with value 0of type 1
DEBUG 23:33:39,755 - constant factor is type 1
DEBUG 23:33:39,755 - term SingleFactorterm is type 1
DEBUG 23:33:39,755 - exprWithNoMinus is type 1
INFO  23:33:39,755 - Print calls = 0
ERROR 23:33:39,756 - Parsiranje NIJE uspesno zavrseno!
